In [3]:
import pandas as pd

In [69]:
population = pd.Series([9904312, 3448737, 2890451, 2466052], index = ['서울', '부산', '인천', '대구'])

In [70]:
population

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [71]:
# 인구수가 250만 이상의 도시를 출력!

In [72]:
population > 2500000

서울     True
부산     True
인천     True
대구    False
dtype: bool

In [73]:
population[population >= 2500000]

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [74]:
population[population <= 5000000]

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [75]:
## and연산자 : & > 여러개의 조건을 모두 만족하는 것만 출력
## ()로 각 조건들을 묶어 줘야한다.
population[(5000000 >= population) & (population >= 2500000)]

부산    3448737
인천    2890451
dtype: int64

In [76]:
# SERIES 슬라이싱

In [77]:
population[1:3]

부산    3448737
인천    2890451
dtype: int64

In [78]:
population['부산':'대구']

부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [79]:
data = {"서울" : 9631482, "부산" : 3393191, "인천" : 2632035, "대전" : 1490158}
population2 = pd.Series(data)
population2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [80]:
# population 2015년
# population2 2010년
population - population2
# NaN = 널값

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [81]:
ds = population - population2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [82]:
### null값이 아닌 것들 만 출력
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [83]:
### null값인 것들 만 출력
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [84]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [85]:
ds[ds.isnull()]

대구   NaN
대전   NaN
dtype: float64

In [93]:
# Q. 2015년도와 2010년도의 인구 증가율을 계산
# 인구증가율 : (2015 - 2010) / 2010 * 100
rs = (population - population2) / population * 100
rs

대구         NaN
대전         NaN
부산    1.610619
서울    2.754659
인천    8.940335
dtype: float64

In [94]:
rs[rs.notnull()]

부산    1.610619
서울    2.754659
인천    8.940335
dtype: float64

In [96]:
# Series 데이터 갱신, 추가, 삭제

rs["부산"] = 1.6
rs

대구         NaN
대전         NaN
부산    1.600000
서울    2.754659
인천    8.940335
dtype: float64

In [97]:
rs["대구"] = 1.41
rs

대구    1.410000
대전         NaN
부산    1.600000
서울    2.754659
인천    8.940335
dtype: float64

In [99]:
rs["광주"] = 2.5
rs

대구    1.410000
대전         NaN
부산    1.600000
서울    2.754659
인천    8.940335
광주    2.500000
dtype: float64

In [101]:
del(rs["광주"]) 
rs

대구    1.410000
대전         NaN
부산    1.600000
서울    2.754659
인천    8.940335
dtype: float64

In [103]:
data = {"2015" : [9904312, 3448737, 2890451, 2466052],
        "2010" : [9631482, 3393191, 2632035, 2431774]
       }
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [107]:
# 인덱스 수정
df.index = ['서울', '부산', '인천', '대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [115]:
data = [[9904312, 3448737, 2890451, 2466052],
        [9631482, 3393191, 2632035, 2431774]]
ind = ['2015', '2010'] # 행
col = ['서울', '부산', '인천', '대구'] # 열
df2 = pd.DataFrame(data,index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  2431774

In [117]:
# T : 인덱스와 컬럼의 위치 바꾸기
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [147]:
data = [[9904312, 9631482], 
        [3448737, 3393191], 
        [2890451, 2632035], 
        [2466052, 2431774],
        ]
ind = ['서울', '부산', '인천', '대구']
col = ['2015', '2010']
df3 = pd.DataFrame(data, index = ind, columns = col)
df3

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [148]:
# values : 데이터 프레임 안에 있는 값 확인
df3.values

array([[9904312, 9631482],
       [3448737, 3393191],
       [2890451, 2632035],
       [2466052, 2431774]], dtype=int64)

In [149]:
# index : 데이터 프레임의 index 확인
df3.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [150]:
# columns : 데이터 프레임의 column 확인
df3.columns

Index(['2015', '2010'], dtype='object')

In [151]:
# DateFrame으로 출력
df3[["2010"]]

       2010
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [163]:
df3[["2010", "2015"]]

       2010     2015
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [164]:
df3["2005"] = [9432546, 3512547, 2517680, 2456016]
df3

       2015     2010     2005
서울  9904312  9631482  9432546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [175]:
df3["2005_2010_증감"] = df3["2010"] - df3["2005"]
df3

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9432546        198936
부산  3448737  3393191  3512547       -119356
인천  2890451  2632035  2517680        114355
대구  2466052  2431774  2456016        -24242

In [178]:
# DataFrame 행 인덱싱
df3[0:1]

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9432546        198936

In [177]:
#index 값 입력 하면 [이상 : 이하]
df3["서울" : "부산"]

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9432546        198936
부산  3448737  3393191  3512547       -119356

In [194]:
# loc인덱서 : loc[행, 열] 
# index와 column의 값을 직접 사용
df3.loc["서울" : "부산" , "2015" : "2010"]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [195]:
# iloc인덱서 : loc[행, 열]
# index와 column의 번호를 사용
df3.iloc[0 : 2, 0 : 2]

       2015     2010
서울  9904312  9631482
부산  3448737  3393191

In [196]:
### 2015년 데이터중 인구가 2500000이상인 데이터들만 출력
df3[df3["2015"] > 2500000]

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9432546        198936
부산  3448737  3393191  3512547       -119356
인천  2890451  2632035  2517680        114355

In [212]:
df3

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9432546        198936
부산  3448737  3393191  3512547       -119356
인천  2890451  2632035  2517680        114355
대구  2466052  2431774  2456016        -24242

In [214]:
df3[["2015"]][df3["2015"] > 2500000]

       2015
서울  9904312
부산  3448737
인천  2890451

In [236]:
df3[df3["2015"] > 2500000].loc[:, :"2015"]

       2015
서울  9904312
부산  3448737
인천  2890451

In [229]:
df3["2015"]["서울"]

9904312

In [269]:
df3["서울"]["2015"]

KeyError: '서울'

In [226]:
df3.loc["서울"]["2015"]

9904312

In [232]:
df3[:"서울"]["2015"]

서울    9904312
Name: 2015, dtype: int64

In [234]:
df3["2015"]

서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [237]:
df3[:"서울"]

       2015     2010     2005  2005_2010_증감
서울  9904312  9631482  9432546        198936

In [248]:
population_number = pd.read_csv("population_number.csv", encoding = "euc_kr")
population_number

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [249]:
# 내가 원하는 column을 index로 만들기
population_number = pd.read_csv("population_number.csv", 
                                index_col = "도시", 
                                encoding = "euc_kr")
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [250]:
# value_counts()
# 값이 나온 횟수를 세주는 함수

In [255]:
population_number["지역"].value_counts()

수도권    2
경상권    2
Name: 지역, dtype: int64

In [256]:
### 셀 합치기
#에디터 모드(파란색)에서 합치고 싶은 셀 중 위에서 
# shift + m
### 셀 나누기
#입력 모드(연두색)에서 나누고 싶은 셀의 위치에 커서 두고 
# ctrl + shift + "-"

In [258]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [261]:
# 인덱스 값을 기준으로 정렬
# sort_index
# 한글은 가나다순, 영어는 abc순, 숫자는 오름차순
population_number.sort_index()

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

In [262]:
# 데이터 값을 기준으로 정렬
# sort_values
#series 정렬

# 오름차순
population_number["2015"].sort_values()

도시
대구    2466052
인천    2890451
부산    3448737
서울    9904312
Name: 2015, dtype: int64

In [263]:
# 내림차순
population_number["2015"].sort_values(ascending = False)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [265]:
#DataFrame안에서 정렬
population_number.sort_values(by = "2010")

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [266]:
population_number.sort_values(by = "2010", ascending = False)
# null값은 오름차순이든 내림차순이든 마지막에 출력해 준다.

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [268]:
# DataFrame 안에서 정렬
# 두 개를 기준(이중)
population_number.sort_values(by = ["지역", "2010"])
#지역을 가나다 순으로 먼저 정렬한 후 2010년안에서 오름차순으로 정렬

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972